app/controllers/buybitcoins_controller.rb

SELECT "buybitcoins".* FROM "buybitcoins"
---
  def index
    @buybitcoins = Buybitcoin.all

INSERT INTO "buybitcoins" ("usd", "btc", "mail", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["usd", 2], ["btc", 2], ["mail", "abc@gmail.com"], ["phone", "123123123123"], ["created_at", "2015-01-28 06:58:46.223892"], ["updated_at", "2015-01-28 06:58:46.223892"]]
---
  def create
    @buybitcoin = Buybitcoin.new(buybitcoin_params)

    respond_to do |format|
      if @buybitcoin.save

UPDATE "buybitcoins" SET "usd" = ?, "btc" = ?, "mail" = ?, "phone" = ?, "updated_at" = ? WHERE "buybitcoins"."id" = ?  [["usd", 123], ["btc", 123], ["mail", "abc@gmail.com"], ["phone", "123123123123"], ["updated_at", "2015-01-27 22:04:35.024838"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @buybitcoin.update(buybitcoin_params)

SELECT  "buybitcoins".* FROM "buybitcoins" WHERE "buybitcoins"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_buybitcoin
      @buybitcoin = Buybitcoin.find(params[:id])